/**
 * 
 * @param {Number} w  爆源的物质质量
 * @param {Number} q  爆源的爆热 或者燃烧热
 */
/* 常见凝聚相含能材料爆炸炸药的爆热
  TNT	4520	
  硝化甘油	6700
  黑索今（ROX）	5630	
  太安（PETN）	5800
  B炸药（60%RDX,40%TNT）	5190	
  喷托里特（50%PETN，5%TNT）	5110
  C-4炸药（91%RDX,9%塑料粘接剂）	4870	
  苦味酸	4180
  奥克托今（HMX）	5680	
  叠氮化银	1890
  叠氮化铅	1540	
  特屈儿	4520
  斯蒂芬酸铅	1910	
  奥克托尔（50%TNT，30%HMX）	4500
  雷汞	1790
*/
/*部分物质的燃烧热
  汽油  44000
  甲苯	42381	
  丙烯腈	33127
  甲醇	22690	
  甲醛	78088
  苯	41792	
  苯乙烯	42029
  丙烷	50290	
  溴甲烷	8101
  二硫化碳	13538			
*/
let tntWeight = (w, q, isSolid = true) => {
  // 液体、气体
  if (!isSolid) {
    // 蒸汽云当量系数：4%
    // 地面爆炸系数：1.8
    return 0.04 * 1.8 * w * q / 4520;
  }
  //固体
  return w * q / 4520;
}
module.exports.default = module.exports = tntWeight;